{
    "defaultModel": "gpt-3.5-turbo",
    "defaultType": "openai",
    "defaultAuth": "api-key",
    "defaultBase": "",
    "defaultVersion": "",
    "defaultKey": "",
    "availableModels": [
      {
        "value": "gpt-3.5-turbo",
        "label": "GPT-3.5-TURBO (Default ChatGPT)"
      },
      {
        "value": "gpt-3.5-turbo-0613",
        "label": "GPT-3.5-TURBO-0613"
      },
      {
        "value": "gpt-3.5-turbo-0301",
        "label": "GPT-3.5-TURBO-0301 (Legacy)"
      },
      {
        "value": "gpt-3.5-turbo-16k",
        "label": "GPT-3.5-TURBO-16K"
      },
      {
        "value": "gpt-3.5-turbo-16k-0613",
        "label": "GPT-3.5-TURBO-16K-0613"
      },
      {
        "value": "gpt-4",
        "label": "GPT-4 (Limited Beta)"
      },
      {
        "value": "gpt-4-0613",
        "label": "GPT-4-0613 (Limited Beta)"
      },
      {
        "value": "gpt-4-0314",
        "label": "GPT-4-0314 (Limited Beta, Legacy)"
      },
      {
        "value": "gpt-4-32k",
        "label": "GPT-4-32K (Limited Beta)"
      },
      {
        "value": "gpt-4-32k-0613",
        "label": "GPT-4-32K-0613 (Limited Beta)"
      },
      {
        "value": "gpt-4-32k-0314",
        "label": "GPT-4-32K-0314 (Limited Beta, Legacy)"
      }
    ],
    "writingCharacters": [
      {
        "label": "Stand-up-Comedian",
        "value": "Ein Künstler, der das Publikum durch Witze und humorvolle Geschichten unterhält."
      },
      {
        "label": "Lebensberater",
        "value": "Ein Fachmann, der Einzelpersonen hilft, ihre persönlichen und beruflichen Ziele zu identifizieren und zu erreichen."
      },
      {
        "label": "Berufsberater",
        "value": "Ein Fachmann, der Einzelpersonen hilft, Berufe zu erkunden und auszuwählen, Job-Suchstrategien zu entwickeln und die Arbeitsleistung zu verbessern."
      },
      {
        "label": "Ernährungsberater",
        "value": "Ein Gesundheitsfachmann, der sich auf das Studium der Ernährung und ihre Auswirkungen auf den Körper spezialisiert hat."
      },
      {
        "label": "Produktmanager",
        "value": "Ein Fachmann, der die Entwicklung und Vermarktung der Produkte eines Unternehmens überwacht."
      },
      {
        "label": "Personal Trainer",
        "value": "Ein Fitnessfachmann, der mit Einzelpersonen zusammenarbeitet, um individuelle Trainingsprogramme zu entwickeln und ihre allgemeine Gesundheit und Fitness zu verbessern."
      },
      {
        "label": "Life Hacker",
        "value": "Eine Person, die unkonventionelle Methoden verwendet, um Probleme zu lösen und die Produktivität im Alltag zu steigern."
      },
      {
        "label": "Reiseberater",
        "value": "Ein Fachmann, der Einzelpersonen hilft, Reisearrangements zu planen und zu buchen."
      },
      {
        "label": "Achtsamkeitstrainer",
        "value": "Ein Fachmann, der Einzelpersonen hilft, Achtsamkeitspraktiken zu entwickeln, um Stress zu reduzieren und das Wohlbefinden zu verbessern."
      },
      {
        "label": "Finanzberater",
        "value": "Ein Fachmann, der Beratung und Ratschläge zur Finanzplanung, Anlagestrategien und Altersvorsorge bietet."
      },
      {
        "label": "Sprachlehrer",
        "value": "Ein Lehrer, der Einzelpersonen hilft, ihre Sprachkenntnisse zu erlernen und zu verbessern."
      },
      {
        "label": "Reiseführer",
        "value": "Ein Fachmann, der Touren leitet und Informationen über lokale Sehenswürdigkeiten und Kultur bietet."
      },
      {
        "label": "Marketingexperte",
        "value": "Ein Fachmann, der Marketingstrategien entwickelt und umsetzt, um Produkte und Dienstleistungen zu fördern."
      },
      {
        "label": "Softwareentwickler",
        "value": "Ein Fachmann, der Softwareanwendungen und -systeme entwirft, entwickelt und wartet."
      },
      {
        "label": "Dating Coach",
        "value": "Ein Fachmann, der Einzelpersonen hilft, ihre Dating- und Beziehungsfähigkeiten zu verbessern."
      },
      {
        "label": "DIY-Experte",
        "value": "Eine Person, die geschickt darin ist, eine Vielzahl von Heimwerkerprojekten rund um das Haus abzuschließen."
      },
      {
        "label": "Journalist",
        "value": "Ein Fachmann, der aktuelle Ereignisse und Nachrichten recherchiert und darüber berichtet."
      },
      {
        "label": "Technikautor",
        "value": "Ein Fachmann, der über Technologie und verwandte Themen für verschiedene Zielgruppen schreibt."
      },
      {
        "label": "Professioneller Koch",
        "value": "Ein qualifizierter kulinarischer Fachmann, der Mahlzeiten zubereitet und Küchenabläufe leitet."
      },
      {
        "label": "Professioneller Verkäufer",
        "value": "Ein Fachmann, der Produkte und Dienstleistungen an Unternehmen und Verbraucher verkauft."
      },
      {
        "label": "Startup Tech Anwalt",
        "value": "Ein Rechtsfachmann, der sich darauf spezialisiert hat, Start-up-Technologieunternehmen rechtliche Beratung und Dienstleistungen zu bieten."
      },
      {
        "label": "Grafikdesigner",
        "value": "Ein Fachmann, der visuelle Materialien wie Logos, Broschüren und Websites entwirft."
      },
      {
        "label": "Akademischer Forscher",
        "value": "Ein Fachmann, der Forschung betreibt und wissenschaftliche Arbeiten in einem bestimmten akademischen Bereich produziert."
      },
      {
        "label": "Kundendienstmitarbeiter",
        "value": "Ein Fachmann, der Unterstützung und Hilfe für Kunden bietet, die Fragen oder Probleme mit den Produkten oder Dienstleistungen eines Unternehmens haben."
      },
      {
        "label": "HR-Berater",
        "value": "Ein Fachmann, der Organisationen Beratung und Ratschläge zur Personalverwaltung und -strategie bietet."
      },

      {
        "label": "No-Code Entwickler",
        "value": "Ein Fachmann, der Anwendungen, Websites und andere Softwareprodukte erstellt, ohne Code zu schreiben, indem er visuelle Entwicklungstools und vorgefertigte Komponenten verwendet."
    },
    {
        "label": "Front-End Entwickler",
        "value": "Ein Fachmann, der Benutzeroberflächen für Websites und Anwendungen entwirft und entwickelt, unter Verwendung von HTML, CSS und JavaScript."
    },
    {
        "label": "Back-End Entwickler",
        "value": "Ein Fachmann, der die Serverseite von Websites und Anwendungen erstellt und wartet, unter Verwendung von Technologien wie Node.js, Python und Ruby on Rails."
    },
    {
        "label": "Full-Stack Entwickler",
        "value": "Ein Fachmann, der sowohl an der Front-End als auch an der Back-End von Websites und Anwendungen arbeiten kann und alles von der Datenbankgestaltung bis zur Benutzeroberflächenentwicklung handhabt."
    },
    {
        "label": "Webflow Entwickler",
        "value": "Ein Fachmann, der Websites mit Webflow entwirft und entwickelt, einer visuellen Entwicklungsplattform, die erweiterte Anpassungen ohne die Notwendigkeit von Programmierkenntnissen ermöglicht."
    },
    {
        "label": "Softwareentwickler",
        "value": "Ein Fachmann, der Softwareanwendungen und -systeme entwirft, entwickelt und wartet."
    },
    {
        "label": "UX Designer",
        "value": "Ein Fachmann, der Benutzererfahrungen für Websites und Anwendungen entwirft, unter Verwendung von Forschung, Wireframing und Prototyping-Techniken, um intuitive Schnittstellen zu erstellen."
    },
    {
        "label": "UI Designer",
        "value": "Ein Fachmann, der die visuellen Elemente von Benutzeroberflächen für Websites und Anwendungen entwirft, unter Verwendung von Tools wie Adobe XD, Sketch und Figma."
    },
    {
        "label": "Webdesigner",
        "value": "Ein Fachmann, der die visuellen Aspekte von Websites entwirft, einschließlich Layouts, Farbschemata, Typografie und Benutzeroberflächen, unter Verwendung von Tools wie Adobe Photoshop, Sketch und Figma."
    },
    {
        "label": "Produktdesigner",
        "value": "Ein Fachmann, der das gesamte Benutzererlebnis eines Produkts entwirft, einschließlich seines Aussehens und Gefühls, der Benutzeroberfläche und des Interaktionsdesigns, unter Verwendung von Tools wie Sketch, Figma und InVision."
    },
    {
        "label": "Produktmanager",
        "value": "Ein Fachmann, der die Entwicklung und Vermarktung der Produkte eines Unternehmens überwacht."
    },
    {
        "label": "Marketingexperte",
        "value": "Ein Fachmann, der Marketingstrategien entwickelt und umsetzt, um Produkte und Dienstleistungen zu fördern."
    },
    {
        "label": "Growth Hacker",
        "value": "Ein Fachmann, der kreative und analytische Marketingtechniken verwendet, um die Benutzerbasis und den Umsatz eines Produkts oder einer Dienstleistung schnell zu steigern, unter Verwendung von Kanälen wie sozialen Medien, E-Mail und SEO."
    },
    {
        "label": "SEO Experte",
        "value": "Ein Fachmann, der Websites und Inhalte optimiert, um ihre Sichtbarkeit und Platzierung in den Suchmaschinenergebnisseiten zu verbessern, unter Verwendung von Techniken wie Keyword-Recherche, Linkaufbau und Inhaltoptimierung."
    },
    {
        "label": "Technischer Schriftsteller",
        "value": "Ein Fachmann, der über Technologie und verwandte Themen für verschiedene Zielgruppen schreibt."
    },
    {
        "label": "Texter",
        "value": "Ein Fachmann, der schriftliche Inhalte für Websites, Marketingmaterialien und andere Medien erstellt, unter Verwendung von überzeugender Sprache und Erzähltechniken, um Zielgruppen zu binden und zu konvertieren."
    },
    {
        "label": "Datenwissenschaftler",
        "value": "Ein Fachmann, der statistische und maschinelle Lernmethoden verwendet, um große Mengen von Daten zu analysieren und Erkenntnisse für Geschäftsentscheidungen abzuleiten."
    },
    {
        "label": "Maschinelles Lernen Ingenieur",
        "value": "Ein Fachmann, der Systeme entwirft, erstellt und wartet, die maschinelle Lernalgorithmen verwenden, um Automatisierung, Genauigkeit und Entscheidungsfindung zu verbessern."
    },
    {
        "label": "Datenbankadministrator",
        "value": "Ein Fachmann, der Datenbanken für Organisationen verwaltet und wartet, um Datenintegrität, Sicherheit und Verfügbarkeit zu gewährleisten."
    },
    {
        "label": "Systemadministrator",
        "value": "Ein Fachmann, der die Hardware- und Softwareinfrastruktur installiert, konfiguriert und wartet, die die IT-Systeme einer Organisation unterstützt."
    },
    {
        "label": "Netzwerkingenieur",
        "value": "Ein Fachmann, der Computernetzwerke für Organisationen entwirft, implementiert und wartet, um Konnektivität, Sicherheit und Leistung zu gewährleisten."
    },
    {
        "label": "Cybersicherheitsanalyst",
        "value": "Ein Fachmann, der Organisationen vor Cyberangriffen schützt, indem er Netzwerke überwacht, Schwachstellen identifiziert und Sicherheitsmaßnahmen implementiert."
    },
    {
        "label": "DevOps Ingenieur",
        "value": "Ein Fachmann, der Softwareentwicklung und IT-Betrieb kombiniert, um die Bereitstellung und Verwaltung von Softwareanwendungen zu rationalisieren."
    },
    {
        "label": "Cloud Architekt",
        "value": "Ein Fachmann, der Cloud-Computing-Lösungen für Organisationen entwirft und die Implementierung überwacht, unter Verwendung von Plattformen wie AWS, Azure und Google Cloud."
    },
    {
        "label": "Startup Tech Anwalt",
        "value": "Ein Rechtsfachmann, der sich darauf spezialisiert hat, Start-up-Technologieunternehmen rechtliche Beratung und Dienstleistungen anzubieten."
    },
    {
        "label": "Mobile App Entwickler",
        "value": "Ein Fachmann, der Anwendungen für mobile Geräte entwirft und entwickelt, unter Verwendung von Sprachen wie Java, Kotlin, Swift und React Native."
    },
    {
        "label": "Spielentwickler",
        "value": "Ein Fachmann, der Videospiele entwirft und entwickelt, unter Verwendung von Spiel-Engines wie Unity und Unreal Engine und Programmiersprachen wie C++ und C#."
    }
    
    ],
    "writingTones": [
      "Bestimmt",
      "Professionell",
      "Gesprächig",
      "Humorvoll",
      "Technisch",
      "Inspirierend",
      "Bildend",
      "Ermutigend",
      "Überzeugend",
      "Analytisch",
      "Optimistisch",
      "Kritisch",
      "Kreativ",
      "Kollaborativ",
      "Autoritär",
      "Fragend",
      "Einfühlsam",
      "Nachdenklich",
      "Informativ",
      "Sachlich",
      "Begeistert",
      "Neutral",
      "Respektvoll",
      "Zynisch",
      "Skeptisch"
    ],
    "writingStyles": [
      "Akademisch",
      "Analytisch",
      "Argumentativ",
      "Gesprächig",
      "Kreativ",
      "Kritisch",
      "Beschreibend",
      "Erklärend",
      "Informativ",
      "Anweisend",
      "Untersuchend",
      "Journalistisch",
      "Metaphorisch",
      "Erzählend",
      "Überzeugend",
      "Poetisch",
      "Satirisch",
      "Technisch",
      "Formell",
      "Umgangssprachlich",
      "Reflektierend",
      "Rhetorisch",
      "Subjektiv",
      "Objektiv"
    ],
    "writingFormats": [
      {
        "value": "Antworte so knapp wie möglich",
        "label": "Kurz und knapp"
      },
      {
        "value": "Denke Schritt für Schritt",
        "label": "Schritt-für-Schritt"
      },
      {
        "value": "Antworte in äußerst detaillierter Weise",
        "label": "Extrem detailliert"
      },
      {
        "value": "Erkläre es mir, als wäre ich fünf",
        "label": "Erkläre wie für ein 5-jähriges Kind"
      }
    ],
    
    "showDownloadLink": true,
    "allowDarkModeToggle": true,
    "allowSettingsModal": true,
    "allowDatabaseModal": true,
    "showTwitterLink": true,
    "showFeedbackLink": true
  }